{
	"name": "Cristiano Ronaldo",
	"topic": "tham khảo",
	"price": 780000,
	"course_of_class": true,
	"description": "Cristiano Ronaldo dos Santos Aveiro (phát âm tiếng Bồ Đào Nha: [kɾiʃˈtjɐnu ʁɔˈnaɫdu]; sinh ngày 5 tháng 2 năm 1985) là một cầu thủ bóng đá chuyên nghiệp người Bồ Đào Nha hiện đang thi đấu ở vị trí tiền đạo và là đội trưởng của câu lạc bộ Saudi Pro League Al Nassr và Đội tuyển bóng đá quốc gia Bồ Đào Nha. Được coi là một trong những cầu thủ vĩ đại nhất mọi thời đại,[8] Ronaldo là chủ nhân của 5 Quả bóng vàng châu Âu[ghi chú 3] và 4 Chiếc giày vàng châu Âu. Anh đã giành được 32 danh hiệu trong sự nghiệp của mình, bao gồm 7 chức vô địch quốc gia, 5 UEFA Champions League, 1 UEFA European Championship và 1 UEFA Nations League. Ronaldo nắm giữ kỷ lục về số lần ra sân nhiều nhất (183), nhiều bàn thắng nhất (140) và nhiều pha kiến tạo nhất (42) ở Champions League, nhiều bàn thắng nhất ở giải vô địch châu Âu (14), nhiều bàn thắng quốc tế nhất (122) và có số lần ra sân quốc tế nhiều nhất (198). Anh là một trong số ít những cầu thủ đã có hơn 1.100 lần ra sân và đã ghi hơn 800 bàn thắng chính thức trong sự nghiệp cho câu lạc bộ và đội tuyển quốc gia. Anh là cầu thủ duy nhất ghi bàn trong 5 kỳ World Cup.",
	"lessons": [
		{
    		"name": "Sporting CP",
    		"lesson_number": 1,
    		"content": "Ở tuổi 16, Ronaldo được tuyển vào đội trẻ của Sporting bởi huấn luyện viên đội một László Bölöni, người rất ấn tượng với khả năng rê dắt bóng của anh.[25] Sau đó, anh trở thành cầu thủ đầu tiên thi đấu cho các đội U-16, U-17, U-18, đội B và đội một của câu lạc bộ chỉ trong vòng một mùa giải.[26] Một năm sau, vào ngày 29 tháng 9 năm 2002, Ronaldo có trận ra mắt gặp Braga ở Primeira Liga và vào ngày 7 tháng 10 năm 2002, anh ghi hai bàn vào lưới Moreirense trong chiến thắng 3–0 của họ.[27] Trong suốt mùa giải 2002–03, người đại diện của Ronaldo đã đề xuất anh với huấn luyện viên Liverpool Gérard Houllier và chủ tịch Barcelona Joan Laporta.[28] Huấn luyện viên Arsène Wenger đã gặp anh tại sân nhà của Arsenal vào tháng 11 nhằm thảo luận về một thương vụ chuyển nhượng có thể xảy ra.",
    		"documents": [
        		{
            		"name": "Alex Ferguson mua Ronaldo",
            		"description": "Huấn luyện viên Manchester United Alex Ferguson quyết tâm phải mua bằng được Ronaldo, sau khi Sporting đánh bại United 3–1 tại lễ khánh thành sân vận động Estádio José Alvalade vào tháng 8 năm 2003",
            		"topic": null
        		},
        		{
            		"name": "Kế hoạch cho Sporting mượn lại",
            		"description": "Ban đầu, Man United chỉ định ký hợp đồng với Ronaldo và sau đó cho Sporting mượn lại trong một năm.[30] Bị ấn tượng, các cầu thủ Manchester United đã thúc giục Ferguson nhanh chóng ký hợp đồng với anh",
            		"topic": null
        		},
        		{
            		"name": "Sporting vinh danh Ronaldo",
            		"description": "Một thập kỷ sau khi anh rời câu lạc bộ, vào tháng 4 năm 2013, Sporting vinh danh Ronaldo bằng việc chọn anh trở thành thành viên thứ 100.000 của họ.",
            		"topic": null
        		}
    		]
		},
		{
    		"name": "Manchester United",
    		"lesson_number": 1,
    		"content": "Ronaldo trở thành cầu thủ Bồ Đào Nha đầu tiên chơi cho Manchester United khi anh ký hợp đồng trước mùa giải 2003–04.",
    		"documents": [
        		{
            		"name": "2003–2007: Phát triển sự nghiệp và đột phá",
            		"description": "Ronaldo có trận ra mắt tại Premier League trong chiến thắng 4–0 trên sân nhà trước Bolton Wanderers vào ngày 16 tháng 8 năm 2003, nhận được sự hoan nghênh nhiệt liệt khi anh vào sân thay cho Nicky Butt.[39] Màn trình diễn của anh còn nhận được lời khen có cánh từ George Best, người đã ca ngợi đây là \"màn ra mắt thú vị nhất\" mà ông từng xem.",
            		"topic": null
        		},
        		{
            		"name": "2007–2008: Thành công tập thể và cá nhân",
            		"description": "Tại vòng tứ kết UEFA Champions League 2006–07, Ronaldo ghi bàn trong trận đấu thứ 30 của anh ở giải đấu này,[65] lập cú đúp trong chiến thắng 7–1 trước Roma.",
            		"topic": null
        		},
        		{
            		"name": "2008–2009: Mùa giải cuối cùng và tiếp tục thành công",
        		    "description": "Trước mùa giải 2008–09, vào ngày 7 tháng 7, Ronaldo trải qua cuộc phẫu thuật mắt cá chân,[94] khiến anh phải nghỉ thi đấu trong 10 tuần.[95] Sau khi trở lại, anh ghi bàn thắng thứ 100 trên mọi đấu trường cho United bằng quả đá phạt trong chiến thắng 5–0 trước Stoke City vào ngày 15 tháng 11,[96] anh đã chọc thủng lưới tất cả 19 đội ở Premier League vào thời điểm đó.",
        		    "topic": null
        		}
    		]
		},
		{
			"name": "Real Madrid",
    		"lesson_number": 1,
    		"content": "Trước mùa giải 2009–10, Ronaldo gia nhập Real Madrid với mức phí chuyển nhượng kỷ lục thế giới vào thời điểm đó, 80 triệu bảng (94 triệu euro).",
    		"documents": [
        		{
            		"name": "2009–2013: Thương vụ chuyển nhượng kỷ lục thế giới",
            		"description": "Hợp đồng của anh có thời hạn đến năm 2015, với mức lương 11 triệu euro mỗi mùa và có điều khoản mua đứt 1 tỷ euro.[111] Ít nhất 80.000 người hâm mộ đã tham dự buổi lễ ra mắt của anh tại Santiago Bernabéu, vượt qua kỷ lục 75.000 người hâm mộ đến chào đón Diego Maradona tại Napoli 25 năm về trước.",
        		    "topic": null
        		},
        		{
        		    "name": "2013–2015: Liên tiếp giành Quả bóng vàng FIFA và La Décima",
        		    "description": "Sau kỳ nghỉ đông mùa giải 2012–13, Ronaldo đeo băng đội trưởng Real Madrid lần đầu tiên trong một trận đấu chính thức, lập cú đúp để giúp Madrid giành chiến thắng 4–3 trước Real Sociedad vào ngày 6 tháng 1.",
        		    "topic": null
        		},
        		{
        		    "name": "2015–2017: Cầu thủ ghi nhiều bàn thắng nhất mọi thời đại của Real Madrid",
        		    "description": "Vào đầu mùa giải thứ bảy của anh tại Madrid, mùa 2015–16, Ronaldo trở thành cầu thủ ghi nhiều bàn thắng nhất mọi thời đại của câu lạc bộ, đầu tiên là tại La Liga và sau đó là trên mọi đấu trường.",
        		    "topic": null
        		},
        		{
        		    "name": "2017–2018: Chức vô địch Champions League thứ năm và Quả bóng vàng thứ năm",
        		    "description": "Vào đầu mùa giải 2017–18, Ronaldo ghi bàn thắng thứ hai cho Madrid ở phút 80 trong chiến thắng 3–1 trước Barcelona tại trận lượt đi Supercopa de España 2017 ở Camp Nou; tuy nhiên, anh bị đuổi khỏi sân hai phút sau đó và bỏ lỡ trận lượt về.",
        		    "topic": null
        		}
    		]
		},
		{
    		"name": "Juventus",
    		"lesson_number": 1,
    		"content": "Bất chấp nhiều tháng đàm phán về một bản hợp đồng mới với Real Madrid,[226] vào ngày 10 tháng 7 năm 2018, Ronaldo ký hợp đồng có thời hạn 4 năm với câu lạc bộ Ý Juventus sau khi hoàn tất thương vụ chuyển nhượng trị giá 100 triệu euro, bao gồm thêm 12 triệu euro phụ phí khác.",
    		"documents": [
    		    {
    		        "name": "2018–2020: Các chức vô địch Serie A liên tiếp",
    		        "description": "Vào ngày 18 tháng 8, Ronaldo có trận ra mắt trong chiến thắng 3–2 trên sân khách trước ChievoVerona.[232] Vào ngày 16 tháng 9, Ronaldo ghi hai bàn thắng đầu tiên cho Juventus trong lần ra sân thứ tư ở trận thắng 2–1 trên sân nhà trước Sassuolo ở Serie A; bàn thắng thứ hai của Ronaldo là bàn thắng thứ 400 trong sự nghiệp của anh.",
    		        "topic": null
    		    },
    		    {
    		        "name": "2020–2021: 100 bàn thắng cho Juventus, Capocannoniere và rời câu lạc bộ",
    		        "description": "Vào ngày 20 tháng 9 năm 2020, Ronaldo ghi bàn trong trận đấu mở màn mùa giải của Juventus, chiến thắng 3–0 trên sân nhà trước Sampdoria.[265] Vào ngày 1 tháng 11, sau khi Ronaldo mất gần ba tuần để điều trị COVID-19, anh trở lại trong trận đấu gặp Spezia; anh vào sân từ băng ghế dự bị trong hiệp hai và ghi bàn trong vòng ba phút đầu tiên, trước khi ghi bàn thắng thứ hai từ chấm phạt đền trong chiến thắng 4–1 trên sân khách.",
    		        "topic": null
    		    }
    		]
		},
		{
    		"name": "Trở lại Manchester United",
    		"lesson_number": 1,
    		"content": "Vào ngày 27 tháng 8 năm 2021, Manchester United thông báo rằng họ đã đạt được thỏa thuận với Juventus để tái ký hợp đồng với Ronaldo, tùy thuộc vào thỏa thuận liên quan đến các điều khoản cá nhân, thị thực và y tế.",
    		"documents": [
        		{
            		"name": "2021–2022: 100 bàn thắng ở Premier League và nội bộ lục đục",
        		    "description": "Vào ngày 11 tháng 9, Ronaldo có trận tái xuất tại Old Trafford, ghi hai bàn mở tỷ số trong chiến thắng 4–1 trước Newcastle United.[289] Vào ngày 29 tháng 9, anh ghi bàn thắng ấn định tỷ số ở phút cuối cùng trong chiến thắng 2–1 của United trên sân nhà trước Villarreal ở Champions League, vượt qua Iker Casillas để trở thành cầu thủ có nhiều lần ra sân nhất giải đấu.",
        		    "topic": null
        		},
        		{
            		"name": "2022: Mùa giải cuối cùng và rời câu lạc bộ",
            		"description": "Sau khi ngày càng bất mãn với cách thức lãnh đạo của United trong và ngoài sân cỏ, Ronaldo đã bỏ lỡ chuyến du đấu tiền mùa giải của câu lạc bộ ở Thái Lan và Úc vì lý do gia đình, trong bối cảnh có thông tin cho rằng anh muốn rời đi để gia nhập một câu lạc bộ thi đấu ở Champions League, mặc dù tân huấn luyện viên Erik ten Hag khẳng định rằng anh không phải để bán và là một phần trong kế hoạch của câu lạc bộ.",
            		"topic": null
        		}
    		]
		},
		{
    		"name": "Al Nassr",
    		"lesson_number": 1,
    		"content": "Vào ngày 30 tháng 12 năm 2022, câu lạc bộ Ả Rập Xê Út Al Nassr đã đạt được thỏa thuận chiêu mộ Ronaldo với bản hợp đồng có hiệu lực từ ngày 1 tháng 1 năm 2023, thời hạn kéo dài đến năm 2025.",
    		"documents": []
		}
	]
}
	